apache/nuttx/arch/arm/src/stm32u0/hardware/stm32u0_rcc.h
/****************************************************************************
 * arch/arm/src/stm32u0/hardware/stm32u0_rcc.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_STM32U0_HARDWARE_STM32U0_RCC_H
#define __ARCH_ARM_SRC_STM32U0_HARDWARE_STM32U0_RCC_H

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register Offsets *********************************************************/

#define STM32_RCC_CR_OFFSET           0x0000 /* Clock control register */
#define STM32_RCC_ICSCR_OFFSET        0x0004 /* Internal clock sources calibration register */
#define STM32_RCC_CFGR_OFFSET         0x0008 /* Clock configuration register */
#define STM32_RCC_PLLCFG_OFFSET       0x000c /* PLL clock configuration register */
#define STM32_RCC_CIER_OFFSET         0x0018 /* Clock interrupt enable register */
#define STM32_RCC_CIFR_OFFSET         0x001c /* Clock interrupt flag register */
#define STM32_RCC_CICR_OFFSET         0x0020 /* Clock interrupt clear register */
#define STM32_RCC_AHBRSTR_OFFSET      0x0028 /* AHB peripheral reset register */
#define STM32_RCC_IOPRSTR_OFFSET      0x002c /* GPIO reset register */
#define STM32_RCC_APB1RSTR_OFFSET     0x0038 /* APB1 peripheral reset register (APBRSTR1) */
#define STM32_RCC_APB2RSTR_OFFSET     0x0040 /* APB2 peripheral reset register (APBRSTR2) */
#define STM32_RCC_AHBENR_OFFSET       0x0048 /* AHB peripheral clock enable register */
#define STM32_RCC_IOPENR_OFFSET       0x004c /* GPIO clock enable register */
#define STM32_RCC_DBGCFGR_OFFSET      0x0050 /* Debug configuration register */
#define STM32_RCC_APB1ENR_OFFSET      0x0058 /* APB1 peripheral clock enable register (APBENR1) */
#define STM32_RCC_APB2ENR_OFFSET      0x0060 /* APB2 peripheral clock enable register (APBENR2) */
#define STM32_RCC_AHBSMENR_OFFSET     0x0068 /* AHB peripheral clock enable in Sleep mode register */
#define STM32_RCC_IOPSMENR_OFFSET     0x006c /* GPIO clock enable in Sleep mode register */
#define STM32_RCC_APB1SMENR_OFFSET    0x0078 /* APB1 peripheral clock enable in Sleep mode register */
#define STM32_RCC_APB2SMENR_OFFSET    0x0080 /* APB2 peripheral clock enable in Sleep mode register */
#define STM32_RCC_CCIPR_OFFSET        0x0088 /* Peripherals independent clock configuration register */
#define STM32_RCC_BDCR_OFFSET         0x0090 /* RTC domain control register */
#define STM32_RCC_CSR_OFFSET          0x0094 /* Control/status register */
#define STM32_RCC_CRRCR_OFFSET        0x0098 /* Clock recovery RC register */

/* Register Addresses *******************************************************/

#define STM32_RCC_CR                  (STM32_RCC_BASE+STM32_RCC_CR_OFFSET)
#define STM32_RCC_ICSCR               (STM32_RCC_BASE+STM32_RCC_ICSCR_OFFSET)
#define STM32_RCC_CFGR                (STM32_RCC_BASE+STM32_RCC_CFGR_OFFSET)
#define STM32_RCC_PLLCFG              (STM32_RCC_BASE+STM32_RCC_PLLCFG_OFFSET)
#define STM32_RCC_CIER                (STM32_RCC_BASE+STM32_RCC_CIER_OFFSET)
#define STM32_RCC_CIFR                (STM32_RCC_BASE+STM32_RCC_CIFR_OFFSET)
#define STM32_RCC_CICR                (STM32_RCC_BASE+STM32_RCC_CICR_OFFSET)
#define STM32_RCC_AHBRSTR             (STM32_RCC_BASE+STM32_RCC_AHBRSTR_OFFSET)
#define STM32_RCC_IOPRSTR             (STM32_RCC_BASE+STM32_RCC_IOPRSTR_OFFSET)
#define STM32_RCC_APB1RSTR            (STM32_RCC_BASE+STM32_RCC_APB1RSTR_OFFSET)
#define STM32_RCC_APB2RSTR            (STM32_RCC_BASE+STM32_RCC_APB2RSTR_OFFSET)
#define STM32_RCC_AHBENR              (STM32_RCC_BASE+STM32_RCC_AHBENR_OFFSET)
#define STM32_RCC_IOPENR              (STM32_RCC_BASE+STM32_RCC_IOPENR_OFFSET)
#define STM32_RCC_DBGCFGR             (STM32_RCC_BASE+STM32_RCC_DBGCFGR_OFFSET)
#define STM32_RCC_APB1ENR             (STM32_RCC_BASE+STM32_RCC_APB1ENR_OFFSET)
#define STM32_RCC_APB2ENR             (STM32_RCC_BASE+STM32_RCC_APB2ENR_OFFSET)
#define STM32_RCC_AHBSMENR            (STM32_RCC_BASE+STM32_RCC_AHBSMENR_OFFSET)
#define STM32_RCC_IOPSMENR            (STM32_RCC_BASE+STM32_RCC_IOPSMENR_OFFSET)
#define STM32_RCC_APB1SMENR           (STM32_RCC_BASE+STM32_RCC_APB1SMENR_OFFSET)
#define STM32_RCC_APB2SMENR           (STM32_RCC_BASE+STM32_RCC_APB2SMENR_OFFSET)
#define STM32_RCC_CCIPR               (STM32_RCC_BASE+STM32_RCC_CCIPR_OFFSET)
#define STM32_RCC_BDCR                (STM32_RCC_BASE+STM32_RCC_BDCR_OFFSET)
#define STM32_RCC_CSR                 (STM32_RCC_BASE+STM32_RCC_CSR_OFFSET)
#define STM32_RCC_CRRCR               (STM32_RCC_BASE+STM32_RCC_CRRCR_OFFSET)

/* Register Bitfield Definitions ********************************************/

/* Clock control register */

#define RCC_CR_MSION                  (1 << 0) /* Bit 0: MSI clock enable */
#define RCC_CR_MSIRDY                 (1 << 1) /* Bit 1: MSI clock ready flag */
#define RCC_CR_MSIPLLEN               (1 << 2) /* Bit 2: MSI clock PLL enable */
#define RCC_CR_MSIRGSEL               (1 << 3) /* Bit 3: MSI clock range selection */
#define RCC_CR_MSIRANGE_SHIFT         (4)      /* Bits 4-7: MSI clock ranges */
#define RCC_CR_MSIRANGE_MASK          (0x0f << RCC_CR_MSIRANGE_SHIFT)
#  define RCC_CR_MSIRANGE_0           (0 << RCC_CR_MSIRANGE_SHIFT)  /* 100 kHz */
#  define RCC_CR_MSIRANGE_1           (1 << RCC_CR_MSIRANGE_SHIFT)  /* 200 kHz */
#  define RCC_CR_MSIRANGE_2           (2 << RCC_CR_MSIRANGE_SHIFT)  /* 400 kHz */
#  define RCC_CR_MSIRANGE_3           (3 << RCC_CR_MSIRANGE_SHIFT)  /* 800 kHz */
#  define RCC_CR_MSIRANGE_4           (4 << RCC_CR_MSIRANGE_SHIFT)  /* 1 MHz */
#  define RCC_CR_MSIRANGE_5           (5 << RCC_CR_MSIRANGE_SHIFT)  /* 2 MHz */
#  define RCC_CR_MSIRANGE_6           (6 << RCC_CR_MSIRANGE_SHIFT)  /* 4 MHz */
#  define RCC_CR_MSIRANGE_7           (7 << RCC_CR_MSIRANGE_SHIFT)  /* 8 MHz */
#  define RCC_CR_MSIRANGE_8           (8 << RCC_CR_MSIRANGE_SHIFT)  /* 16 MHz */
#  define RCC_CR_MSIRANGE_9           (9 << RCC_CR_MSIRANGE_SHIFT)  /* 24 MHz */
#  define RCC_CR_MSIRANGE_10          (10 << RCC_CR_MSIRANGE_SHIFT) /* 32 MHz */
#  define RCC_CR_MSIRANGE_11          (11 << RCC_CR_MSIRANGE_SHIFT) /* 48 MHz */
#define RCC_CR_HSION                  (1 << 8)                      /* Bit 8: HSI16 clock enable */
#define RCC_CR_HSIKERON               (1 << 9)                      /* Bit 9: HSI16 clock enable for some IP kernels */
#define RCC_CR_HSIRDY                 (1 << 10)                     /* Bit 10: HSI16 clock ready flag */
#define RCC_CR_HSIASFS                (1 << 11)                     /* Bit 11: HSI16 automatic start from Stop */
                                                                    /* Bits 12-15: Reserved */
#define RCC_CR_HSEON                  (1 << 16)                     /* Bit 16: HSE clock enable */
#define RCC_CR_HSERDY                 (1 << 17)                     /* Bit 17: HSE clock ready flag */
#define RCC_CR_HSEBYP                 (1 << 18)                     /* Bit 18: HSE clock bypass */
#define RCC_CR_CSSON                  (1 << 19)                     /* Bit 19: HSE clock security system enable */
                                                                    /* Bits 20-23: Reserved */
#define RCC_CR_PLLON                  (1 << 24)                     /* Bit 24: PLL enable */
#define RCC_CR_PLLRDY                 (1 << 25)                     /* Bit 25: PLL clock ready flag */
                                                                    /* Bits 26-31: Reserved */

