apache/nuttx/arch/arm/src/stm32u0/hardware/stm32u0_rcc.h
/* Internal clock sources calibration register */

#define RCC_ICSCR_MSICAL_SHIFT        (0) /* Bits 0-7: MSI clock calibration */
#define RCC_ICSCR_MSICAL_MASK         (0xff << RCC_ICSCR_MSICAL_SHIFT)
#define RCC_ICSCR_MSITRIM_SHIFT       (8) /* Bits 8-15: MSI clock trimming */
#define RCC_ICSCR_MSITRIM_MASK        (0xff << RCC_ICSCR_MSITRIM_SHIFT)
#define RCC_ICSCR_HSICAL_SHIFT        (16) /* Bits 16-23: HSI16 clock calibration */
#define RCC_ICSCR_HSICAL_MASK         (0xff << RCC_ICSCR_HSICAL_SHIFT)
#define RCC_ICSCR_HSITRIM_SHIFT       (24) /* Bits 24-30: HSI16 clock trimming */
#define RCC_ICSCR_HSITRIM_MASK        (0x7f << RCC_ICSCR_HSITRIM_SHIFT)

/* Clock configuration register */

#define RCC_CFGR_SW_SHIFT             (0) /* Bits 0-2: System clock switch */
#define RCC_CFGR_SW_MASK              (7 << RCC_CFGR_SW_SHIFT)
#  define RCC_CFGR_SW_MSI             (0 << RCC_CFGR_SW_SHIFT) /* 000: MSI */
#  define RCC_CFGR_SW_HSI             (1 << RCC_CFGR_SW_SHIFT) /* 001: HSI16 */
#  define RCC_CFGR_SW_HSE             (2 << RCC_CFGR_SW_SHIFT) /* 010: HSE */
#  define RCC_CFGR_SW_PLL             (3 << RCC_CFGR_SW_SHIFT) /* 011: PLLRCLK */
#  define RCC_CFGR_SW_LSI             (4 << RCC_CFGR_SW_SHIFT) /* 100: LSI */
#  define RCC_CFGR_SW_LSE             (5 << RCC_CFGR_SW_SHIFT) /* 101: LSE */
#define RCC_CFGR_SWS_SHIFT            (3)                      /* Bits 3-5: System clock switch status */
#define RCC_CFGR_SWS_MASK             (7 << RCC_CFGR_SWS_SHIFT)
#  define RCC_CFGR_SWS_MSI            (0 << RCC_CFGR_SWS_SHIFT) /* 000: MSI */
#  define RCC_CFGR_SWS_HSI            (1 << RCC_CFGR_SWS_SHIFT) /* 001: HSI16 */
#  define RCC_CFGR_SWS_HSE            (2 << RCC_CFGR_SWS_SHIFT) /* 010: HSE */
#  define RCC_CFGR_SWS_PLL            (3 << RCC_CFGR_SWS_SHIFT) /* 011: PLLRCLK */
#  define RCC_CFGR_SWS_LSI            (4 << RCC_CFGR_SWS_SHIFT) /* 100: LSI */
#  define RCC_CFGR_SWS_LSE            (5 << RCC_CFGR_SWS_SHIFT) /* 101: LSE */
                                                                /* Bits 6-7: Reserved */
#define RCC_CFGR_HPRE_SHIFT           (8)                       /* Bits 8-11: AHB prescaler */
#define RCC_CFGR_HPRE_MASK            (0x0f << RCC_CFGR_HPRE_SHIFT)
#  define RCC_CFGR_HPRE_SYSCLK        (0 << RCC_CFGR_HPRE_SHIFT)  /* 0xxx: SYSCLK not divided */
#  define RCC_CFGR_HPRE_SYSCLKd2      (8 << RCC_CFGR_HPRE_SHIFT)  /* 1000: SYSCLK divided by 2 */
#  define RCC_CFGR_HPRE_SYSCLKd4      (9 << RCC_CFGR_HPRE_SHIFT)  /* 1001: SYSCLK divided by 4 */
#  define RCC_CFGR_HPRE_SYSCLKd8      (10 << RCC_CFGR_HPRE_SHIFT) /* 1010: SYSCLK divided by 8 */
#  define RCC_CFGR_HPRE_SYSCLKd16     (11 << RCC_CFGR_HPRE_SHIFT) /* 1011: SYSCLK divided by 16 */
#  define RCC_CFGR_HPRE_SYSCLKd64     (12 << RCC_CFGR_HPRE_SHIFT) /* 1100: SYSCLK divided by 64 */
#  define RCC_CFGR_HPRE_SYSCLKd128    (13 << RCC_CFGR_HPRE_SHIFT) /* 1101: SYSCLK divided by 128 */
#  define RCC_CFGR_HPRE_SYSCLKd256    (14 << RCC_CFGR_HPRE_SHIFT) /* 1110: SYSCLK divided by 256 */
#  define RCC_CFGR_HPRE_SYSCLKd512    (15 << RCC_CFGR_HPRE_SHIFT) /* 1111: SYSCLK divided by 512 */
#define RCC_CFGR_PPRE1_SHIFT          (12)                        /* Bits 12-14: APB prescaler (PPRE) */
#define RCC_CFGR_PPRE1_MASK           (7 << RCC_CFGR_PPRE1_SHIFT)
#  define RCC_CFGR_PPRE1_HCLK         (0 << RCC_CFGR_PPRE1_SHIFT) /* 0xx: HCLK not divided */
#  define RCC_CFGR_PPRE1_HCLKd2       (4 << RCC_CFGR_PPRE1_SHIFT) /* 100: HCLK divided by 2 */
#  define RCC_CFGR_PPRE1_HCLKd4       (5 << RCC_CFGR_PPRE1_SHIFT) /* 101: HCLK divided by 4 */
#  define RCC_CFGR_PPRE1_HCLKd8       (6 << RCC_CFGR_PPRE1_SHIFT) /* 110: HCLK divided by 8 */
#  define RCC_CFGR_PPRE1_HCLKd16      (7 << RCC_CFGR_PPRE1_SHIFT) /* 111: HCLK divided by 16 */
#define RCC_CFGR_STOPWUCK             (1 << 15)                   /* Bit 15: Wakeup from Stop and CSS backup clock selection */
#define RCC_CFGR_MCO2SEL_SHIFT        (16)                        /* Bits 16-19: MCO2 clock output selection */
#define RCC_CFGR_MCO2SEL_MASK         (0x0f << RCC_CFGR_MCO2SEL_SHIFT)
#define RCC_CFGR_MCO2PRE_SHIFT        (20) /* Bits 20-23: MCO2 prescaler */
#define RCC_CFGR_MCO2PRE_MASK         (0x0f << RCC_CFGR_MCO2PRE_SHIFT)
#define RCC_CFGR_MCO1SEL_SHIFT        (24) /* Bits 24-27: MCO1 clock output selection */
#define RCC_CFGR_MCO1SEL_MASK         (0x0f << RCC_CFGR_MCO1SEL_SHIFT)
#define RCC_CFGR_MCO1PRE_SHIFT        (28) /* Bits 28-31: MCO1 prescaler */
#define RCC_CFGR_MCO1PRE_MASK         (0x0f << RCC_CFGR_MCO1PRE_SHIFT)

/* Compatibility aliases for MCO (MCO1) */

#define RCC_CFGR_MCOSEL_SHIFT         RCC_CFGR_MCO1SEL_SHIFT
#define RCC_CFGR_MCOSEL_MASK          RCC_CFGR_MCO1SEL_MASK
#define RCC_CFGR_MCOPRE_SHIFT         RCC_CFGR_MCO1PRE_SHIFT
#define RCC_CFGR_MCOPRE_MASK          RCC_CFGR_MCO1PRE_MASK

/* PLL clock configuration register */

#define RCC_PLLCFG_PLLSRC_SHIFT       (0) /* Bits 0-1: PLL entry clock source */
#define RCC_PLLCFG_PLLSRC_MASK        (3 << RCC_PLLCFG_PLLSRC_SHIFT)
#  define RCC_PLLCFG_PLLSRC_NOCLK     (0 << RCC_PLLCFG_PLLSRC_SHIFT) /* 00: No clock */
#  define RCC_PLLCFG_PLLSRC_MSI       (1 << RCC_PLLCFG_PLLSRC_SHIFT) /* 01: MSI */
#  define RCC_PLLCFG_PLLSRC_HSI       (2 << RCC_PLLCFG_PLLSRC_SHIFT) /* 10: HSI16 */
#  define RCC_PLLCFG_PLLSRC_HSE       (3 << RCC_PLLCFG_PLLSRC_SHIFT) /* 11: HSE */
#define RCC_PLLCFG_PLLM_SHIFT         (4)                            /* Bits 4-6: Division factor M of the PLL input clock divider */
#define RCC_PLLCFG_PLLM_MASK          (7 << RCC_PLLCFG_PLLM_SHIFT)
#define RCC_PLLCFG_PLLM(n)            ((n-1) << RCC_PLLCFG_PLLM_SHIFT) /* n=1,...,8 */
                                                                       /* Bit 7: Reserved */
#define RCC_PLLCFG_PLLN_SHIFT         (8)                              /* Bits 8-14: PLL frequency multiplication factor N */
#define RCC_PLLCFG_PLLN_MASK          (0x7f << RCC_PLLCFG_PLLN_SHIFT)
#define RCC_PLLCFG_PLLN(n)            ((n) << RCC_PLLCFG_PLLN_SHIFT) /* n=4,...,127 */
                                                                     /* Bit 15: Reserved */
#define RCC_PLLCFG_PLLPEN             (1 << 16)                      /* Bit 16: PLLPCLK clock output enable */
#define RCC_PLLCFG_PLLP_SHIFT         (17)                           /* Bits 17-21: PLL VCO division factor P for PLLPCLK clock output */
#define RCC_PLLCFG_PLLP_MASK          (0x1f << RCC_PLLCFG_PLLP_SHIFT)
#define RCC_PLLCFG_PLLP(n)            ((n-1) << RCC_PLLCFG_PLLP_SHIFT) /* n=2,...,32 */
                                                                       /* Bits 22-23: Reserved */
#define RCC_PLLCFG_PLLQEN             (1 << 24)                        /* Bit 24: PLLQCLK clock output enable */
#define RCC_PLLCFG_PLLQ_SHIFT         (25)                             /* Bits 25-27: PLL VCO division factor Q for PLLQCLK clock output */
#define RCC_PLLCFG_PLLQ_MASK          (7 << RCC_PLLCFG_PLLQ_SHIFT)
#define RCC_PLLCFG_PLLQ(n)            ((n-1) << RCC_PLLCFG_PLLQ_SHIFT) /* n=2,...,8 */
#define RCC_PLLCFG_PLLREN             (1 << 28)                        /* Bit 28: PLLRCLK clock output enable */
#define RCC_PLLCFG_PLLR_SHIFT         (29)                             /* Bits 29-31: PLL VCO division factor R for PLLRCLK clock output */
#define RCC_PLLCFG_PLLR_MASK          (7 << RCC_PLLCFG_PLLR_SHIFT)
#define RCC_PLLCFG_PLLR(n)            ((n-1) << RCC_PLLCFG_PLLR_SHIFT) /* n=2,...,8 */

