apache/nuttx/arch/arm/src/stm32u0/hardware/stm32u0_rcc.h
/* Clock interrupt enable register */

#define RCC_CIER_LSIRDYIE             (1 << 0)  /* Bit 0: LSI ready interrupt enable */
#define RCC_CIER_LSERDYIE             (1 << 1)  /* Bit 1: LSE ready interrupt enable */
#define RCC_CIER_MSIRDYIE             (1 << 2)  /* Bit 2: MSI ready interrupt enable */
#define RCC_CIER_HSIRDYIE             (1 << 3)  /* Bit 3: HSI16 ready interrupt enable */
#define RCC_CIER_HSERDYIE             (1 << 4)  /* Bit 4: HSE ready interrupt enable */
#define RCC_CIER_PLLRDYIE             (1 << 5)  /* Bit 5: PLL ready interrupt enable */
                                                /* Bits 6-8: Reserved */
#define RCC_CIER_LSECSSIE             (1 << 9)  /* Bit 9: LSE clock security system interrupt enable */
#define RCC_CIER_HSI48RDYIE           (1 << 10) /* Bit 10: HSI48 ready interrupt enable */

/* Clock interrupt flag register */

#define RCC_CIFR_LSIRDYF              (1 << 0)  /* Bit 0: LSI ready interrupt flag */
#define RCC_CIFR_LSERDYF              (1 << 1)  /* Bit 1: LSE ready interrupt flag */
#define RCC_CIFR_MSIRDYF              (1 << 2)  /* Bit 2: MSI ready interrupt flag */
#define RCC_CIFR_HSIRDYF              (1 << 3)  /* Bit 3: HSI16 ready interrupt flag */
#define RCC_CIFR_HSERDYF              (1 << 4)  /* Bit 4: HSE ready interrupt flag */
#define RCC_CIFR_PLLRDYF              (1 << 5)  /* Bit 5: PLL ready interrupt flag */
                                                /* Bits 6-7: Reserved */
#define RCC_CIFR_CSSF                 (1 << 8)  /* Bit 8: HSE clock security system interrupt flag */
#define RCC_CIFR_LSECSSF              (1 << 9)  /* Bit 9: LSE clock security system interrupt flag */
#define RCC_CIFR_HSI48RDYF            (1 << 10) /* Bit 10: HSI48 ready interrupt flag */

/* Clock interrupt clear register */

#define RCC_CICR_LSIRDYC              (1 << 0)  /* Bit 0: LSI ready interrupt clear */
#define RCC_CICR_LSERDYC              (1 << 1)  /* Bit 1: LSE ready interrupt clear */
#define RCC_CICR_MSIRDYC              (1 << 2)  /* Bit 2: MSI ready interrupt clear */
#define RCC_CICR_HSIRDYC              (1 << 3)  /* Bit 3: HSI16 ready interrupt clear */
#define RCC_CICR_HSERDYC              (1 << 4)  /* Bit 4: HSE ready interrupt clear */
#define RCC_CICR_PLLRDYC              (1 << 5)  /* Bit 5: PLL ready interrupt clear */
                                                /* Bits 6-7: Reserved */
#define RCC_CICR_CSSC                 (1 << 8)  /* Bit 8: HSE clock security system interrupt clear */
#define RCC_CICR_LSECSSC              (1 << 9)  /* Bit 9: LSE clock security system interrupt clear */
#define RCC_CICR_HSI48RDYC            (1 << 10) /* Bit 10: HSI48 ready interrupt clear */

/* AHB peripheral reset register */

#define RCC_AHBRSTR_DMA1RST           (1 << 0)  /* Bit 0: DMA1 reset */
#define RCC_AHBRSTR_DMA2RST           (1 << 1)  /* Bit 1: DMA2 reset */
                                                /* Bits 2-7: Reserved */
#define RCC_AHBRSTR_FLASHRST          (1 << 8)  /* Bit 8: Flash memory interface reset */
                                                /* Bits 9-11: Reserved */
#define RCC_AHBRSTR_CRCRST            (1 << 12) /* Bit 12: CRC reset */
                                                /* Bits 13-15: Reserved */
#define RCC_AHBRSTR_AESRST            (1 << 16) /* Bit 16: AES hardware accelerator reset */
                                                /* Bit 17: Reserved */
#define RCC_AHBRSTR_RNGRST            (1 << 18) /* Bit 18: Random number generator reset */
                                                /* Bits 19-23: Reserved */
#define RCC_AHBRSTR_TSCRST            (1 << 24) /* Bit 24: Touch sensing controller reset */
                                                /* Bits 25-31: Reserved */

/* GPIO reset register */

#define RCC_IOPRSTR_IOPARST           (1 << 0) /* Bit 0: IO port A reset */
#define RCC_IOPRSTR_IOPBRST           (1 << 1) /* Bit 1: IO port B reset */
#define RCC_IOPRSTR_IOPCRST           (1 << 2) /* Bit 2: IO port C reset */
#define RCC_IOPRSTR_IOPDRST           (1 << 3) /* Bit 3: IO port D reset */
#define RCC_IOPRSTR_IOPERST           (1 << 4) /* Bit 4: IO port E reset */
#define RCC_IOPRSTR_IOPFRST           (1 << 5) /* Bit 5: IO port F reset */

/* APB1 peripheral reset register (APBRSTR1) */

#define RCC_APB1RSTR_TIM2RST          (1 << 0)  /* Bit 0:  Timer 2 reset */
#define RCC_APB1RSTR_TIM3RST          (1 << 1)  /* Bit 1:  Timer 3 reset */
                                                /* Bits 2-3: Reserved */
#define RCC_APB1RSTR_TIM6RST          (1 << 4)  /* Bit 4:  Timer 6 reset */
#define RCC_APB1RSTR_TIM7RST          (1 << 5)  /* Bit 5:  Timer 7 reset */
                                                /* Bit 6: Reserved */
#define RCC_APB1RSTR_LPUART2RST       (1 << 7)  /* Bit 7:  Low-power UART 2 reset */
                                                /* Bit 8: Reserved */
#define RCC_APB1RSTR_LCDRST           (1 << 9)  /* Bit 9:  LCD controller reset */
                                                /* Bits 10-11: Reserved */
#define RCC_APB1RSTR_LPUART3RST       (1 << 12) /* Bit 12: Low-power UART 3 reset */
#define RCC_APB1RSTR_USBRST           (1 << 13) /* Bit 13: USB reset */
#define RCC_APB1RSTR_SPI2RST          (1 << 14) /* Bit 14: SPI2 reset */
#define RCC_APB1RSTR_SPI3RST          (1 << 15) /* Bit 15: SPI3 reset */
#define RCC_APB1RSTR_CRSRST           (1 << 16) /* Bit 16: CRS reset */
#define RCC_APB1RSTR_USART2RST        (1 << 17) /* Bit 17: USART2 reset */
#define RCC_APB1RSTR_USART3RST        (1 << 18) /* Bit 18: USART3 reset */
#define RCC_APB1RSTR_USART4RST        (1 << 19) /* Bit 19: USART4 reset */
#define RCC_APB1RSTR_LPUART1RST       (1 << 20) /* Bit 20: Low-power UART 1 reset */
#define RCC_APB1RSTR_I2C1RST          (1 << 21) /* Bit 21: I2C1 reset */
#define RCC_APB1RSTR_I2C2RST          (1 << 22) /* Bit 22: I2C2 reset */
#define RCC_APB1RSTR_I2C3RST          (1 << 23) /* Bit 23: I2C3 reset */
#define RCC_APB1RSTR_OPAMPRST         (1 << 24) /* Bit 24: OPAMP reset */
#define RCC_APB1RSTR_I2C4RST          (1 << 25) /* Bit 25: I2C4 reset */
#define RCC_APB1RSTR_LPTIM3RST        (1 << 26) /* Bit 26: Low-power timer 3 reset */
                                                /* Bit 27: Reserved */
#define RCC_APB1RSTR_PWRRST           (1 << 28) /* Bit 28: PWR reset */
#define RCC_APB1RSTR_DAC1RST          (1 << 29) /* Bit 29: DAC1 reset */
#define RCC_APB1RSTR_LPTIM2RST        (1 << 30) /* Bit 30: Low-power timer 2 reset */
#define RCC_APB1RSTR_LPTIM1RST        (1 << 31) /* Bit 31: Low-power timer 1 reset */

