apache/nuttx/arch/arm/src/stm32u0/hardware/stm32u0_rcc.h
/* APB2 peripheral reset register (APBRSTR2) */

#define RCC_APB2RSTR_SYSCFGRST        (1 << 0)  /* Bit 0:  SYSCFG reset */
                                                /* Bits 1-10: Reserved */
#define RCC_APB2RSTR_TIM1RST          (1 << 11) /* Bit 11: TIM1 timer reset */
#define RCC_APB2RSTR_SPI1RST          (1 << 12) /* Bit 12: SPI1 reset */
                                                /* Bit 13: Reserved */
#define RCC_APB2RSTR_USART1RST        (1 << 14) /* Bit 14: USART1 reset */
                                                /* Bit 15: Reserved */
#define RCC_APB2RSTR_TIM15RST         (1 << 16) /* Bit 16: TIM15 timer reset */
#define RCC_APB2RSTR_TIM16RST         (1 << 17) /* Bit 17: TIM16 timer reset */
                                                /* Bits 18-19: Reserved */
#define RCC_APB2RSTR_ADC1RST          (1 << 20) /* Bit 20: ADC reset */

/* AHB peripheral clock enable register */

#define RCC_AHBENR_DMA1EN             (1 << 0)  /* Bit 0: DMA1 clock enable */
#define RCC_AHBENR_DMA2EN             (1 << 1)  /* Bit 1: DMA2 clock enable */
                                                /* Bits 2-7: Reserved */
#define RCC_AHBENR_FLASHEN            (1 << 8)  /* Bit 8: Flash memory interface clock enable */
                                                /* Bits 9-11: Reserved */
#define RCC_AHBENR_CRCEN              (1 << 12) /* Bit 12: CRC clock enable */
                                                /* Bits 13-15: Reserved */
#define RCC_AHBENR_AESEN              (1 << 16) /* Bit 16: AES hardware accelerator clock enable */
                                                /* Bit 17: Reserved */
#define RCC_AHBENR_RNGEN              (1 << 18) /* Bit 18: Random number generator clock enable */
                                                /* Bits 19-23: Reserved */
#define RCC_AHBENR_TSCEN              (1 << 24) /* Bit 24: Touch sensing controller clock enable */
                                                /* Bits 25-31: Reserved */

/* GPIO clock enable register */

#define RCC_IOPENR_IOPAEN             (1 << 0) /* Bit 0: IO port A clock enable */
#define RCC_IOPENR_IOPBEN             (1 << 1) /* Bit 1: IO port B clock enable */
#define RCC_IOPENR_IOPCEN             (1 << 2) /* Bit 2: IO port C clock enable */
#define RCC_IOPENR_IOPDEN             (1 << 3) /* Bit 3: IO port D clock enable */
#define RCC_IOPENR_IOPEEN             (1 << 4) /* Bit 4: IO port E clock enable */
#define RCC_IOPENR_IOPFEN             (1 << 5) /* Bit 5: IO port F clock enable */

/* Debug configuration register */

#define RCC_DBGCFGR_DBGEN             (1 << 0) /* Bit 0: Debug support clock enable */
#define RCC_DBGCFGR_DBGRST            (1 << 1) /* Bit 1: Debug support reset */

/* APB1 peripheral clock enable register (APBENR1) */

#define RCC_APB1ENR_TIM2EN            (1 << 0)  /* Bit 0:  Timer 2 clock enable */
#define RCC_APB1ENR_TIM3EN            (1 << 1)  /* Bit 1:  Timer 3 clock enable */
                                                /* Bits 2-3: Reserved */
#define RCC_APB1ENR_TIM6EN            (1 << 4)  /* Bit 4:  Timer 6 clock enable */
#define RCC_APB1ENR_TIM7EN            (1 << 5)  /* Bit 5:  Timer 7 clock enable */
                                                /* Bit 6: Reserved */
#define RCC_APB1ENR_LPUART2EN         (1 << 7)  /* Bit 7:  Low-power UART 2 clock enable */
                                                /* Bit 8: Reserved */
#define RCC_APB1ENR_LCDEN             (1 << 9)  /* Bit 9:  LCD controller clock enable */
#define RCC_APB1ENR_RTCAPBEN          (1 << 10) /* Bit 10: RTC APB clock enable */
#define RCC_APB1ENR_WWDGEN            (1 << 11) /* Bit 11: Window watchdog clock enable */
#define RCC_APB1ENR_LPUART3EN         (1 << 12) /* Bit 12: Low-power UART 3 clock enable */
#define RCC_APB1ENR_USBEN             (1 << 13) /* Bit 13: USB clock enable */
#define RCC_APB1ENR_SPI2EN            (1 << 14) /* Bit 14: SPI2 clock enable */
#define RCC_APB1ENR_SPI3EN            (1 << 15) /* Bit 15: SPI3 clock enable */
#define RCC_APB1ENR_CRSEN             (1 << 16) /* Bit 16: CRS clock enable */
#define RCC_APB1ENR_USART2EN          (1 << 17) /* Bit 17: USART2 clock enable */
#define RCC_APB1ENR_USART3EN          (1 << 18) /* Bit 18: USART3 clock enable */
#define RCC_APB1ENR_USART4EN          (1 << 19) /* Bit 19: USART4 clock enable */
#define RCC_APB1ENR_LPUART1EN         (1 << 20) /* Bit 20: Low-power UART 1 clock enable */
#define RCC_APB1ENR_I2C1EN            (1 << 21) /* Bit 21: I2C1 clock enable */
#define RCC_APB1ENR_I2C2EN            (1 << 22) /* Bit 22: I2C2 clock enable */
#define RCC_APB1ENR_I2C3EN            (1 << 23) /* Bit 23: I2C3 clock enable */
#define RCC_APB1ENR_OPAMPEN           (1 << 24) /* Bit 24: OPAMP clock enable */
#define RCC_APB1ENR_I2C4EN            (1 << 25) /* Bit 25: I2C4 clock enable */
#define RCC_APB1ENR_LPTIM3EN          (1 << 26) /* Bit 26: Low-power timer 3 clock enable */
                                                /* Bit 27: Reserved */
#define RCC_APB1ENR_PWREN             (1 << 28) /* Bit 28: PWR clock enable */
#define RCC_APB1ENR_DAC1EN            (1 << 29) /* Bit 29: DAC1 clock enable */
#define RCC_APB1ENR_LPTIM2EN          (1 << 30) /* Bit 30: Low-power timer 2 clock enable */
#define RCC_APB1ENR_LPTIM1EN          (1 << 31) /* Bit 31: Low-power timer 1 clock enable */

/* APB2 peripheral clock enable register (APBENR2) */

#define RCC_APB2ENR_SYSCFGEN          (1 << 0)  /* Bit 0:  SYSCFG clock enable */
                                                /* Bits 1-10: Reserved */
#define RCC_APB2ENR_TIM1EN            (1 << 11) /* Bit 11: TIM1 timer clock enable */
#define RCC_APB2ENR_SPI1EN            (1 << 12) /* Bit 12: SPI1 clock enable */
                                                /* Bit 13: Reserved */
#define RCC_APB2ENR_USART1EN          (1 << 14) /* Bit 14: USART1 clock enable */
                                                /* Bit 15: Reserved */
#define RCC_APB2ENR_TIM15EN           (1 << 16) /* Bit 16: TIM15 timer clock enable */
#define RCC_APB2ENR_TIM16EN           (1 << 17) /* Bit 17: TIM16 timer clock enable */
                                                /* Bits 18-19: Reserved */
#define RCC_APB2ENR_ADC1EN            (1 << 20) /* Bit 20: ADC clock enable */

