apache/nuttx/arch/arm/src/stm32u0/hardware/stm32u0_rcc.h
/* AHB peripheral clock enable in Sleep mode register */

#define RCC_AHBSMENR_DMA1SMEN         (1 << 0)  /* Bit 0: DMA1 clock enable in Sleep mode */
#define RCC_AHBSMENR_DMA2SMEN         (1 << 1)  /* Bit 1: DMA2 clock enable in Sleep mode */
                                                /* Bits 2-7: Reserved */
#define RCC_AHBSMENR_FLASHSMEN        (1 << 8)  /* Bit 8: Flash memory interface clock enable in Sleep mode */
#define RCC_AHBSMENR_SRAM1SMEN        (1 << 9)  /* Bit 9: SRAM1 clock enable in Sleep mode */
                                                /* Bits 10-11: Reserved */
#define RCC_AHBSMENR_CRCSMEN          (1 << 12) /* Bit 12: CRC clock enable in Sleep mode */
                                                /* Bits 13-15: Reserved */
#define RCC_AHBSMENR_AESSMEN          (1 << 16) /* Bit 16: AES clock enable in Sleep mode */
                                                /* Bit 17: Reserved */
#define RCC_AHBSMENR_RNGSMEN          (1 << 18) /* Bit 18: RNG clock enable in Sleep mode */
                                                /* Bits 19-23: Reserved */
#define RCC_AHBSMENR_TSCSMEN          (1 << 24) /* Bit 24: TSC clock enable in Sleep mode */

/* GPIO clock enable in Sleep mode register */

#define RCC_IOPSMENR_IOPASMEN         (1 << 0) /* Bit 0: IO port A clock enable in Sleep mode */
#define RCC_IOPSMENR_IOPBSMEN         (1 << 1) /* Bit 1: IO port B clock enable in Sleep mode */
#define RCC_IOPSMENR_IOPCSMEN         (1 << 2) /* Bit 2: IO port C clock enable in Sleep mode */
#define RCC_IOPSMENR_IOPDSMEN         (1 << 3) /* Bit 3: IO port D clock enable in Sleep mode */
#define RCC_IOPSMENR_IOPESMEN         (1 << 4) /* Bit 4: IO port E clock enable in Sleep mode */
#define RCC_IOPSMENR_IOPFSMEN         (1 << 5) /* Bit 5: IO port F clock enable in Sleep mode */

/* APB1 peripheral clock enable in Sleep mode register (APBSMENR1) */

#define RCC_APB1SMENR_TIM2SMEN        (1 << 0)  /* Bit 0:  Timer 2 clock enable in Sleep mode */
#define RCC_APB1SMENR_TIM3SMEN        (1 << 1)  /* Bit 1:  Timer 3 clock enable in Sleep mode */
                                                /* Bits 2-3: Reserved */
#define RCC_APB1SMENR_TIM6SMEN        (1 << 4)  /* Bit 4:  Timer 6 clock enable in Sleep mode */
#define RCC_APB1SMENR_TIM7SMEN        (1 << 5)  /* Bit 5:  Timer 7 clock enable in Sleep mode */
                                                /* Bit 6: Reserved */
#define RCC_APB1SMENR_LPUART2SMEN     (1 << 7)  /* Bit 7:  LPUART2 clock enable in Sleep mode */
                                                /* Bit 8: Reserved */
#define RCC_APB1SMENR_LCDSMEN         (1 << 9)  /* Bit 9:  LCD clock enable in Sleep mode */
#define RCC_APB1SMENR_RTCAPBSMEN      (1 << 10) /* Bit 10: RTC APB clock enable in Sleep mode */
#define RCC_APB1SMENR_WWDGSMEN        (1 << 11) /* Bit 11: WWDG clock enable in Sleep mode */
#define RCC_APB1SMENR_LPUART3SMEN     (1 << 12) /* Bit 12: LPUART3 clock enable in Sleep mode */
#define RCC_APB1SMENR_USBSMEN         (1 << 13) /* Bit 13: USB clock enable in Sleep mode */
#define RCC_APB1SMENR_SPI2SMEN        (1 << 14) /* Bit 14: SPI2 clock enable in Sleep mode */
#define RCC_APB1SMENR_SPI3SMEN        (1 << 15) /* Bit 15: SPI3 clock enable in Sleep mode */
#define RCC_APB1SMENR_CRSSMEN         (1 << 16) /* Bit 16: CRS clock enable in Sleep mode */
#define RCC_APB1SMENR_USART2SMEN      (1 << 17) /* Bit 17: USART2 clock enable in Sleep mode */
#define RCC_APB1SMENR_USART3SMEN      (1 << 18) /* Bit 18: USART3 clock enable in Sleep mode */
#define RCC_APB1SMENR_USART4SMEN      (1 << 19) /* Bit 19: USART4 clock enable in Sleep mode */
#define RCC_APB1SMENR_LPUART1SMEN     (1 << 20) /* Bit 20: LPUART1 clock enable in Sleep mode */
#define RCC_APB1SMENR_I2C1SMEN        (1 << 21) /* Bit 21: I2C1 clock enable in Sleep mode */
#define RCC_APB1SMENR_I2C2SMEN        (1 << 22) /* Bit 22: I2C2 clock enable in Sleep mode */
#define RCC_APB1SMENR_I2C3SMEN        (1 << 23) /* Bit 23: I2C3 clock enable in Sleep mode */
#define RCC_APB1SMENR_OPAMPSMEN       (1 << 24) /* Bit 24: OPAMP clock enable in Sleep mode */
#define RCC_APB1SMENR_I2C4SMEN        (1 << 25) /* Bit 25: I2C4 clock enable in Sleep mode */
#define RCC_APB1SMENR_LPTIM3SMEN      (1 << 26) /* Bit 26: LPTIM3 clock enable in Sleep mode */
                                                /* Bit 27: Reserved */
#define RCC_APB1SMENR_PWRSMEN         (1 << 28) /* Bit 28: PWR clock enable in Sleep mode */
#define RCC_APB1SMENR_DAC1SMEN        (1 << 29) /* Bit 29: DAC1 clock enable in Sleep mode */
#define RCC_APB1SMENR_LPTIM2SMEN      (1 << 30) /* Bit 30: LPTIM2 clock enable in Sleep mode */
#define RCC_APB1SMENR_LPTIM1SMEN      (1 << 31) /* Bit 31: LPTIM1 clock enable in Sleep mode */

/* APB2 peripheral clock enable in Sleep mode register (APBSMENR2) */

#define RCC_APB2SMENR_SYSCFGSMEN      (1 << 0)  /* Bit 0:  SYSCFG clock enable in Sleep mode */
                                                /* Bits 1-10: Reserved */
#define RCC_APB2SMENR_TIM1SMEN        (1 << 11) /* Bit 11: TIM1 clock enable in Sleep mode */
#define RCC_APB2SMENR_SPI1SMEN        (1 << 12) /* Bit 12: SPI1 clock enable in Sleep mode */
                                                /* Bit 13: Reserved */
#define RCC_APB2SMENR_USART1SMEN      (1 << 14) /* Bit 14: USART1 clock enable in Sleep mode */
                                                /* Bit 15: Reserved */
#define RCC_APB2SMENR_TIM15SMEN       (1 << 16) /* Bit 16: TIM15 clock enable in Sleep mode */
#define RCC_APB2SMENR_TIM16SMEN       (1 << 17) /* Bit 17: TIM16 clock enable in Sleep mode */
                                                /* Bits 18-19: Reserved */
#define RCC_APB2SMENR_ADC1SMEN        (1 << 20) /* Bit 20: ADC clock enable in Sleep mode */

/* Peripherals independent clock configuration register */

#define RCC_CCIPR_USART1SEL_SHIFT     (0) /* Bits 0-1: USART1 clock source selection */
#define RCC_CCIPR_USART1SEL_MASK      (3 << RCC_CCIPR_USART1SEL_SHIFT)
#  define RCC_CCIPR_USART1SEL_PCLK    (0 << RCC_CCIPR_USART1SEL_SHIFT)
#  define RCC_CCIPR_USART1SEL_SYSCLK  (1 << RCC_CCIPR_USART1SEL_SHIFT)
#  define RCC_CCIPR_USART1SEL_HSI16   (2 << RCC_CCIPR_USART1SEL_SHIFT)
#  define RCC_CCIPR_USART1SEL_LSE     (3 << RCC_CCIPR_USART1SEL_SHIFT)
#define RCC_CCIPR_USART2SEL_SHIFT     (2) /* Bits 2-3: USART2 clock source selection */
#define RCC_CCIPR_USART2SEL_MASK      (3 << RCC_CCIPR_USART2SEL_SHIFT)
#  define RCC_CCIPR_USART2SEL_PCLK    (0 << RCC_CCIPR_USART2SEL_SHIFT)
#  define RCC_CCIPR_USART2SEL_SYSCLK  (1 << RCC_CCIPR_USART2SEL_SHIFT)
#  define RCC_CCIPR_USART2SEL_HSI16   (2 << RCC_CCIPR_USART2SEL_SHIFT)
#  define RCC_CCIPR_USART2SEL_LSE     (3 << RCC_CCIPR_USART2SEL_SHIFT)
                                          /* Bits 4-5: Reserved */
#define RCC_CCIPR_LPUART3SEL_SHIFT    (6) /* Bits 6-7: LPUART3 clock source selection */
#define RCC_CCIPR_LPUART3SEL_MASK     (3 << RCC_CCIPR_LPUART3SEL_SHIFT)
#  define RCC_CCIPR_LPUART3SEL_PCLK   (0 << RCC_CCIPR_LPUART3SEL_SHIFT)
#  define RCC_CCIPR_LPUART3SEL_SYSCLK (1 << RCC_CCIPR_LPUART3SEL_SHIFT)
#  define RCC_CCIPR_LPUART3SEL_HSI16  (2 << RCC_CCIPR_LPUART3SEL_SHIFT)
#  define RCC_CCIPR_LPUART3SEL_LSE    (3 << RCC_CCIPR_LPUART3SEL_SHIFT)
#define RCC_CCIPR_LPUART2SEL_SHIFT    (8) /* Bits 8-9: LPUART2 clock source selection */
#define RCC_CCIPR_LPUART2SEL_MASK     (3 << RCC_CCIPR_LPUART2SEL_SHIFT)
#  define RCC_CCIPR_LPUART2SEL_PCLK   (0 << RCC_CCIPR_LPUART2SEL_SHIFT)
#  define RCC_CCIPR_LPUART2SEL_SYSCLK (1 << RCC_CCIPR_LPUART2SEL_SHIFT)
#  define RCC_CCIPR_LPUART2SEL_HSI16  (2 << RCC_CCIPR_LPUART2SEL_SHIFT)
#  define RCC_CCIPR_LPUART2SEL_LSE    (3 << RCC_CCIPR_LPUART2SEL_SHIFT)
#define RCC_CCIPR_LPUART1SEL_SHIFT    (10) /* Bits 10-11: LPUART1 clock source selection */
#define RCC_CCIPR_LPUART1SEL_MASK     (3 << RCC_CCIPR_LPUART1SEL_SHIFT)
#  define RCC_CCIPR_LPUART1SEL_PCLK   (0 << RCC_CCIPR_LPUART1SEL_SHIFT)
#  define RCC_CCIPR_LPUART1SEL_SYSCLK (1 << RCC_CCIPR_LPUART1SEL_SHIFT)
#  define RCC_CCIPR_LPUART1SEL_HSI16  (2 << RCC_CCIPR_LPUART1SEL_SHIFT)
#  define RCC_CCIPR_LPUART1SEL_LSE    (3 << RCC_CCIPR_LPUART1SEL_SHIFT)
#define RCC_CCIPR_I2C1SEL_SHIFT       (12) /* Bits 12-13: I2C1 clock source selection */
#define RCC_CCIPR_I2C1SEL_MASK        (3 << RCC_CCIPR_I2C1SEL_SHIFT)
#  define RCC_CCIPR_I2C1SEL_PCLK      (0 << RCC_CCIPR_I2C1SEL_SHIFT)
#  define RCC_CCIPR_I2C1SEL_SYSCLK    (1 << RCC_CCIPR_I2C1SEL_SHIFT)
#  define RCC_CCIPR_I2C1SEL_HSI16     (2 << RCC_CCIPR_I2C1SEL_SHIFT)
                                           /* Bits 14-15: Reserved */
#define RCC_CCIPR_I2C3SEL_SHIFT       (16) /* Bits 16-17: I2C3 clock source selection */
#define RCC_CCIPR_I2C3SEL_MASK        (3 << RCC_CCIPR_I2C3SEL_SHIFT)
#  define RCC_CCIPR_I2C3SEL_PCLK      (0 << RCC_CCIPR_I2C3SEL_SHIFT)
#  define RCC_CCIPR_I2C3SEL_SYSCLK    (1 << RCC_CCIPR_I2C3SEL_SHIFT)
#  define RCC_CCIPR_I2C3SEL_HSI16     (2 << RCC_CCIPR_I2C3SEL_SHIFT)
#define RCC_CCIPR_LPTIM1SEL_SHIFT     (18) /* Bits 18-19: LPTIM1 clock source selection */
#define RCC_CCIPR_LPTIM1SEL_MASK      (3 << RCC_CCIPR_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR_LPTIM1SEL_PCLK    (0 << RCC_CCIPR_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR_LPTIM1SEL_LSI     (1 << RCC_CCIPR_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR_LPTIM1SEL_HSI16   (2 << RCC_CCIPR_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR_LPTIM1SEL_LSE     (3 << RCC_CCIPR_LPTIM1SEL_SHIFT)
#define RCC_CCIPR_LPTIM2SEL_SHIFT     (20) /* Bits 20-21: LPTIM2 clock source selection */
#define RCC_CCIPR_LPTIM2SEL_MASK      (3 << RCC_CCIPR_LPTIM2SEL_SHIFT)
#  define RCC_CCIPR_LPTIM2SEL_PCLK    (0 << RCC_CCIPR_LPTIM2SEL_SHIFT)
#  define RCC_CCIPR_LPTIM2SEL_LSI     (1 << RCC_CCIPR_LPTIM2SEL_SHIFT)
#  define RCC_CCIPR_LPTIM2SEL_HSI16   (2 << RCC_CCIPR_LPTIM2SEL_SHIFT)
#  define RCC_CCIPR_LPTIM2SEL_LSE     (3 << RCC_CCIPR_LPTIM2SEL_SHIFT)
#define RCC_CCIPR_LPTIM3SEL_SHIFT     (22) /* Bits 22-23: LPTIM3 clock source selection */
#define RCC_CCIPR_LPTIM3SEL_MASK      (3 << RCC_CCIPR_LPTIM3SEL_SHIFT)
#  define RCC_CCIPR_LPTIM3SEL_PCLK    (0 << RCC_CCIPR_LPTIM3SEL_SHIFT)
#  define RCC_CCIPR_LPTIM3SEL_LSI     (1 << RCC_CCIPR_LPTIM3SEL_SHIFT)
#  define RCC_CCIPR_LPTIM3SEL_HSI16   (2 << RCC_CCIPR_LPTIM3SEL_SHIFT)
#  define RCC_CCIPR_LPTIM3SEL_LSE     (3 << RCC_CCIPR_LPTIM3SEL_SHIFT)
#define RCC_CCIPR_TIM1SEL             (1 << 24) /* Bit 24: TIM1 clock source (0=TIMPCLK, 1=PLLQCLK) */
#define RCC_CCIPR_TIM15SEL            (1 << 25) /* Bit 25: TIM15 clock source (0=TIMPCLK, 1=PLLQCLK) */
#define RCC_CCIPR_CLK48SEL_SHIFT      (26)      /* Bits 26-27: 48 MHz clock source selection */
#define RCC_CCIPR_CLK48SEL_MASK       (3 << RCC_CCIPR_CLK48SEL_SHIFT)
#  define RCC_CCIPR_CLK48SEL_HSI48    (0 << RCC_CCIPR_CLK48SEL_SHIFT)
#  define RCC_CCIPR_CLK48SEL_MSI      (1 << RCC_CCIPR_CLK48SEL_SHIFT)
#  define RCC_CCIPR_CLK48SEL_PLLQCLK  (2 << RCC_CCIPR_CLK48SEL_SHIFT)
#define RCC_CCIPR_ADCSEL_SHIFT        (28) /* Bits 28-29: ADC clock source selection */
#define RCC_CCIPR_ADCSEL_MASK         (3 << RCC_CCIPR_ADCSEL_SHIFT)
#  define RCC_CCIPR_ADCSEL_SYSCLK     (0 << RCC_CCIPR_ADCSEL_SHIFT)
#  define RCC_CCIPR_ADCSEL_PLLPCLK    (1 << RCC_CCIPR_ADCSEL_SHIFT)
#  define RCC_CCIPR_ADCSEL_HSI16      (2 << RCC_CCIPR_ADCSEL_SHIFT)

/* RTC domain control register */

