apache/nuttx/arch/arm/src/stm32u0/hardware/stm32u0_rcc.h
#define RCC_BDCR_LSEON                (1 << 0) /* Bit 0: LSE enable */
#define RCC_BDCR_LSERDY               (1 << 1) /* Bit 1: LSE ready */
#define RCC_BDCR_LSEBYP               (1 << 2) /* Bit 2: LSE bypass */
#define RCC_BDCR_LSEDRV_SHIFT         (3)      /* Bits 3-4: LSE driving capability */
#define RCC_BDCR_LSEDRV_MASK          (3 << RCC_BDCR_LSEDRV_SHIFT)
#  define RCC_BDCR_LSEDRV_LOW         (0 << RCC_BDCR_LSEDRV_SHIFT) /* 00: Low */
#  define RCC_BDCR_LSEDRV_MEDLO       (1 << RCC_BDCR_LSEDRV_SHIFT) /* 01: Medium low */
#  define RCC_BDCR_LSEDRV_MEDHI       (2 << RCC_BDCR_LSEDRV_SHIFT) /* 10: Medium high */
#  define RCC_BDCR_LSEDRV_HIGH        (3 << RCC_BDCR_LSEDRV_SHIFT) /* 11: High */
#define RCC_BDCR_LSECSSON             (1 << 5)                     /* Bit 5: CSS on LSE enable */
#define RCC_BDCR_LSECSSD              (1 << 6)                     /* Bit 6: CSS on LSE failure detection */
#define RCC_BDCR_LSESYSEN             (1 << 7)                     /* Bit 7: LSE clock enable for system usage */
#define RCC_BDCR_RTCSEL_SHIFT         (8)                          /* Bits 8-9: RTC clock source selection */
#define RCC_BDCR_RTCSEL_MASK          (3 << RCC_BDCR_RTCSEL_SHIFT)
#  define RCC_BDCR_RTCSEL_NOCLK       (0 << RCC_BDCR_RTCSEL_SHIFT) /* 00: No clock */
#  define RCC_BDCR_RTCSEL_LSE         (1 << RCC_BDCR_RTCSEL_SHIFT) /* 01: LSE */
#  define RCC_BDCR_RTCSEL_LSI         (2 << RCC_BDCR_RTCSEL_SHIFT) /* 10: LSI */
#  define RCC_BDCR_RTCSEL_HSE         (3 << RCC_BDCR_RTCSEL_SHIFT) /* 11: HSE/32 */
                                                                   /* Bit 10: Reserved */
#define RCC_BDCR_LSESYSRDY            (1 << 11)                    /* Bit 11: LSE clock ready for system usage */
                                                                   /* Bits 12-14: Reserved */
#define RCC_BDCR_RTCEN                (1 << 15)                    /* Bit 15: RTC clock enable */
#define RCC_BDCR_BDRST                (1 << 16)                    /* Bit 16: RTC domain software reset */
                                                                   /* Bits 17-23: Reserved */
#define RCC_BDCR_LSCOEN               (1 << 24)                    /* Bit 24: Low-speed clock output enable */
#define RCC_BDCR_LSCOSEL              (1 << 25)                    /* Bit 25: Low-speed clock output selection (0=LSI, 1=LSE) */

/* Control/status register */

#define RCC_CSR_LSION                 (1 << 0) /* Bit 0: LSI enable */
#define RCC_CSR_LSIRDY                (1 << 1) /* Bit 1: LSI ready */
#define RCC_CSR_LSIPREDIV             (1 << 2) /* Bit 2: LSI prescaler (0=div 1, 1=div 128) */
                                               /* Bits 3-7: Reserved */
#define RCC_CSR_MSISTBYRG_SHIFT       (8)      /* Bits 8-11: MSI range after Standby mode */
#define RCC_CSR_MSISTBYRG_MASK        (0x0f << RCC_CSR_MSISTBYRG_SHIFT)
#  define RCC_CSR_MSISTBYRG_1M        (4 << RCC_CSR_MSISTBYRG_SHIFT) /* 1 MHz */
#  define RCC_CSR_MSISTBYRG_2M        (5 << RCC_CSR_MSISTBYRG_SHIFT) /* 2 MHz */
#  define RCC_CSR_MSISTBYRG_4M        (6 << RCC_CSR_MSISTBYRG_SHIFT) /* 4 MHz */
#  define RCC_CSR_MSISTBYRG_8M        (7 << RCC_CSR_MSISTBYRG_SHIFT) /* 8 MHz */
                                                                     /* Bits 12-22: Reserved */
#define RCC_CSR_RMVF                  (1 << 23)                      /* Bit 23: Remove reset flags */
                                                                     /* Bit 24: Reserved */
#define RCC_CSR_OBLRSTF               (1 << 25)                      /* Bit 25: Option bytes loading reset flag */
#define RCC_CSR_PINRSTF               (1 << 26)                      /* Bit 26: PIN reset flag */
#define RCC_CSR_PWRRSTF               (1 << 27)                      /* Bit 27: BOR or POR/PDR reset flag */
#define RCC_CSR_SFTRSTF               (1 << 28)                      /* Bit 28: Software reset flag */
#define RCC_CSR_IWDGRSTF              (1 << 29)                      /* Bit 29: IWDG reset flag */
#define RCC_CSR_WWDGRSTF              (1 << 30)                      /* Bit 30: WWDG reset flag */
#define RCC_CSR_LPWRRSTF              (1 << 31)                      /* Bit 31: Low-power reset flag */

/* Clock recovery RC register */

#define RCC_CRRCR_HSI48ON             (1 << 0) /* Bit 0: HSI48 clock enable */
#define RCC_CRRCR_HSI48RDY            (1 << 1) /* Bit 1: HSI48 clock ready flag */
                                               /* Bits 2-6: Reserved */
#define RCC_CRRCR_HSI48CAL_SHIFT      (7)      /* Bits 7-15: HSI48 clock calibration */
#define RCC_CRRCR_HSI48CAL_MASK       (0x1ff << RCC_CRRCR_HSI48CAL_SHIFT)

#endif /* __ARCH_ARM_SRC_STM32U0_HARDWARE_STM32U0_RCC_H */
